In [ ]:
#pandas操作

In [ ]:
#使用 list或者ndarray对象创建DataFrame
import numpy as np
import pandas as pd

df=pd.DataFrame((['a', 1, 2], ['b', 2, 5], ['c', 3, 3]), columns=['x','y','z']) 
df

   x  y  z
0  a  1  2
1  b  2  5
2  c  3  3

In [ ]:
df=pd.DataFrame(np.zeros((3,3)), columns=['x','y','z']) 
df

     x    y    z
0  0.0  0.0  0.0
1  0.0  0.0  0.0
2  0.0  0.0  0.0

In [ ]:
#使用字典创建DataFrame 使用字典创建DataFrame实例时，利用DataFrame可以将字典的键直接设置为列索引， 
#并且指定—个列表作为字典的值， 字典的值便成为该列索引下所有的 元素。

In [ ]:
df=pd.DataFrame({'x':['a', 'b','c'],'y':range(1,4), 'z':[2,5,3]}) 
df

In [20]:
df=pd.DataFrame(dict(x=['a','b','c'],y=range(1,4), z= [2,5,3])) 
df

   x  y  z
0  a  1  2
1  b  2  5
2  c  3  3

In [ ]:
#数据框数据的选取

In [21]:
#选取某一列
df['y']

0    1
1    2
2    3
Name: y, dtype: int64

In [23]:
df.y
df.loc[:,['y']]
df.iloc[:,[1]]

   y
0  1
1  2
2  3

In [27]:
#选取多列
df[['x','y']]
df.loc[:,['x','y']] 
df.iloc[:,[0,1]]

   x  y
0  a  1
1  b  2
2  c  3

In [30]:
#选择某一行
df.loc[1,:]
df.iloc[1,:]

x    b
y    2
z    5
Name: 1, dtype: object

In [31]:
#选择多行
df.loc[[0,1],:]
df.iloc[[0,1],:]

   x  y  z
0  a  1  2
1  b  2  5

In [32]:
#选取某个元素
df.loc[1,'y']
df.loc[[1],'y']
df.iloc[1,1]

2

In [33]:
#单条件过滤
df[df.z >= 3]

   x  y  z
1  b  2  5
2  c  3  3

In [39]:
#多条件过滤
df[(df.z >=3 )&(df.z<=4)]
df.query('z>=3&z<=4')

   x  y  z
2  c  3  3

In [41]:
#获取数据框的行数
df.shape[0]
len(df)

3

In [ ]:
#获取数据框的列数
df.shape[1]

In [ ]:
#获取数据框的维数
df.shape

In [46]:
#获取数据框的列明和行名（即列索引和行索引）
df.columns
df.index

RangeIndex(start=0, stop=3, step=1)

In [58]:
#重新定义列名
df.columns =["X", "Y", "Z"]
df

   X  Y  Z
0  a  1  2
1  b  2  5
2  c  3  3

In [63]:
#重新更改某列的列名
df.rename(columns= {'X':'x'},inplace=True)
df

   x  Y  Z
0  a  1  2
1  b  2  5
2  c  3  3

In [64]:
#df.rename(columns= {'X':'V'})
#df

In [65]:
#观察数据框的内容
df.info()  #输出dataframe的属性信息

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       3 non-null      object
 1   Y       3 non-null      int64
 2   Z       3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes

In [66]:
df.head()  #查看dataframe前五行的数据信息
df.tail()  #查看dataframe最后五行的数据信息

   x  Y  Z
0  a  1  2
1  b  2  5
2  c  3  3

In [ ]:
#数据框的多重索引

In [70]:
#构造原始数据框
df=pd.DataFrame(dict(X= ['A','B','C','A','B','C'], 
                year=[2010,2010,2010, 2011,2011,2011], 
                Value=[1,3,4,3,5,2])) 
df

   X  year  Value
0  A  2010      1
1  B  2010      3
2  C  2010      4
3  A  2011      3
4  B  2011      5
5  C  2011      2

In [71]:
#设定df的索引为['X', 'year']
df=df.set_index(['X','year'])
df

        Value
X year
A 2010      1
B 2010      3
C 2010      4
A 2011      3
B 2011      5
C 2011      2

In [72]:
#选择某个元素
#其中 'A'为level0索引对应的内容，2010 为level1索引对应的内容，＇Value' 为df的指定列
df.loc[('A',2010),'Value']

1

In [73]:
#选择0级索引下某类的所有元素，slice(None)是切片操作 用于选择任意的 id, 
df.loc[ ('A',slice(None)),'Value']

X  year
A  2010    1
   2011    3
Name: Value, dtype: int64

In [ ]:
#网格分布型数据的创建

In [76]:
a=['A','B','C']
b = [5,7,9] 
X,Y=np.meshgrid(a,b) 
df_grid=pd.DataFrame({'x':X.flatten(),'y':Y.flatten()})
df_grid

   x  y
0  A  5
1  B  5
2  C  5
3  A  7
4  B  7
5  C  7
6  A  9
7  B  9
8  C  9

In [ ]:
#表格变换

In [79]:
#将二维数据列表的数据框转换成一维数据列表,使用pd.melt()方法
#构建数据框
df=pd.DataFrame({'X':['A', 'B','C'],'2010':[1,3,4], '2011':[3,5,2]})
df

   X  2010  2011
0  A     1     3
1  B     3     5
2  C     4     2

In [83]:
#将宽数据转换为长数据
#其中，id.vars("x”)表示由标识变量构成的向量，用于标识观测的变量 ， 
# variable.name ("year”)表示用于保存原始变量名的变量的名称 ， 
# value.name("value”)表示用于保存原始值的名称。
df_melt=pd.melt(df,id_vars='X',var_name='year',value_name='value') 
df_melt

   X  year  value
0  A  2010      1
1  B  2010      3
2  C  2010      4
3  A  2011      3
4  B  2011      5
5  C  2011      2

In [82]:
#将长数据转换为宽数据
df_pivot=df_melt.pivot_table(index='X', columns='year', values='value') 
df_pivot=df_pivot.reset_index() 
df_pivot

year  X  2010  2011
0     A     1     3
1     B     3     5
2     C     4     2

In [ ]:
#变量的变换

In [84]:

df_melt['value2']=df_melt['value']*2
df_melt

   X  year  value  value2
0  A  2010      1       2
1  B  2010      3       6
2  C  2010      4       8
3  A  2011      3       6
4  B  2011      5      10
5  C  2011      2       4

In [95]:
#结合lambda表达式为原数据框添加新列，结合条件语句进行复杂列处理后添加
df_melt['value2']= df_melt.apply(lambda x:x['value']*2 if x['year']=="2011" else x['value'],axis=1)

df_melt

   X  year  value  value2
0  A  2010      1       1
1  B  2010      3       3
2  C  2010      4       4
3  A  2011      3       6
4  B  2011      5      10
5  C  2011      2       4

In [ ]:
#数据框排序

In [96]:
#使用sort_values()函数对数据框排序,ascending=False表示做降序处
dat_sortl =df_melt.sort_values(by='value',ascending= True) 
dat_sortl

   X  year  value  value2
0  A  2010      1       1
5  C  2011      2       4
1  B  2010      3       3
3  A  2011      3       6
2  C  2010      4       4
4  B  2011      5      10

In [97]:
dat_sort2=df_melt.sort_values(by='value',ascending=False) 
dat_sort2

   X  year  value  value2
4  B  2011      5      10
2  C  2010      4       4
1  B  2010      3       3
3  A  2011      3       6
5  C  2011      2       4
0  A  2010      1       1

In [99]:
dat_sort3 =df_melt.sort_values(by= ['year','value'],ascending= True)
dat_sort3

   X  year  value  value2
0  A  2010      1       1
1  B  2010      3       3
2  C  2010      4       4
5  C  2011      2       4
3  A  2011      3       6
4  B  2011      5      10

In [ ]:
#数据框的拼接
#在已有数据框的基础上添加新的行／列，或者横向／纵向添加另外一个数据框

In [155]:
#构建3个数据框
df1=pd.DataFrame(dict(x= ["a","b","c"], y=range(1,4))) 
df2=pd.DataFrame(dict(z= ["B","D","H"], g =[2,5,3])) 
df3=pd.DataFrame(dict(x= ["g","d"], y =[2,5])) 
df1

   x  y
0  a  1
1  b  2
2  c  3

In [113]:
#数据框添加列或横向添加数据框,其中axis表示沿纵轴(axis=O)或者横轴(axis=l)方向连接
dat_cbind = pd.concat([df1,df2],axis= 1) 
dat_cbind

   x  y  z  g
0  a  1  B  2
1  b  2  D  5
2  c  3  H  3

In [114]:
#数据框添加行或者纵向添加表格
dat_rbind=pd.concat([df1,df3],axis=0) 
#或者
dat_rbind =df1.append(df3)
dat_rbind

   x  y
0  a  1
1  b  2
2  c  3
0  g  2
1  d  5

In [115]:
#删除某行／列，需要使用＊．drop(）函数
"""abels就是要删除的行／列的名字，用列表给定，axis默认为0，指删除行，
#因此删除columns时要指定axis=I ; index直接指定要删除的行，columns
#直接指定要删除的列，inplace=False,默认该删除操作不改变原数据，而是
#返回一个执行删除操作后的新DataFrame;inplace=True,则会直接在原数据
#上进行删除操作，且删除后无法返回。"""
df1.drop(labels="y",axis=1, inplace=True)
df1

   x
0  a
1  b
2  c

In [ ]:
#数据框的融合
#  通过设定pd.merge(）函数的不同参数可以实现不同的表格融合效果。
#  其中，两个表格融合会用缺失值NA代替不存在的值。

In [120]:
#构建数据框
df1 =pd.DataFrame(dict(x= ["a","b","c"], y=range(1,4))) 
df2=pd.DataFrame(dict(x= ["a","b","d"], z =[2,5,3])) 
df3=pd.DataFrame(dict(g= ["a","b","d"], z =[2,5,3])) 
df4=pd.DataFrame(dict(x= ["a","b","d"], y=[1,4,2],z =[2,5,3]))

In [126]:
#只保留左表的所有数据
dat_mergel=pd.merge(left=df1,right=df2,how="left",on="x")

In [127]:
#只保留右表的所有数据
dat_merge2=pd.merge(left=df1,right=df2,how="right",on="x")

In [128]:
#只保留两个表中公共部分的信息
dat_merge3=pd.merge(left=df1,right=df2,how="inner",on="x")

In [129]:
#保留两个表的所有信息
dat_merge4=pd.merge(left=df1,right=df2,how="outer",on="x")

In [131]:
#多列匹配
dat_merge5 =pd.merge(left= df1, right= df4, how= "left",on= ["x", "y"])

In [132]:
#根据两个表的不同列名合并
dat_merge6=pd.merge(left=df1,right=df3,how="left", left_on="x", right_on="g")

In [156]:
#如果在表合并的过程中，两个表有—列同名， 但是值不同，合并时又都想保留下来，
#就可以用suffixes给每个表的重复列名增加后缀
dat_merge7 =pd.merge(left=df1,right=df4,how="left", on= "x",suffixes=[".l ",".2"])
dat_merge7

   x  y.l   y.2    z
0  a     1  1.0  2.0
1  b     2  4.0  5.0
2  c     3  NaN  NaN

In [ ]:
#数据框的分组操作

In [161]:
#构造数据框
df= pd.DataFrame({'x':['A','B','C', 'A', 'C'],'2010':[ 1,3,4,4,3],'2011':[3,5,2,8,9]})
df_melt= pd.melt(df,id_vars= ['x'],var_name='year',value_name='value')
df

   x  2010  2011
0  A     1     3
1  B     3     5
2  C     4     2
3  A     4     8
4  C     3     9

In [162]:
#按行或列操作--按行求和
df_rowsum= df[['2010','2011']].apply(lambda x: x.sum(), axis=1)

In [163]:
#按行或列操作--按列求和
df_colsum= df[['2010','2011']].apply(lambda x: x.sum(), axis=0)

In [164]:
#按行或列操作--单列运算：
#在Pandas中，DataFrame的一列就是—个Series,可以通过map或者apply函数来对某—列进行操作
df['2010_2'] = df['2010'].apply(lambda x: x + 2)
df

   x  2010  2011  2010_2
0  A     1     3       3
1  B     3     5       5
2  C     4     2       6
3  A     4     8       6
4  C     3     9       5

In [165]:
#按行或列操作--多列运算
df['2010_2011'] = df.apply(lambda x: x['2010'] + 2 * x['2011'], axis=1) 
df

   x  2010  2011  2010_2  2010_2011
0  A     1     3       3          7
1  B     3     5       5         13
2  C     4     2       6          8
3  A     4     8       6         20
4  C     3     9       5         21

In [ ]:
#分组操作： groupby()函数

In [140]:
#按year分组求均值，
df_group_meanl=df_melt.groupby('year').mean()

In [142]:
#按year和x两列变量分组求均值
df_group_mean2=df_melt.groupby(['year','x'], as_index=False).mean()
#其中，as_index= False不会将['year','x'］两列设定为索引列。

In [166]:
#按year分组求和
df_group_sum= df_melt.groupby('year').sum()
df_group_sum

      value
year
2010     15
2011     27

In [167]:
#按year分组求方差
df_group_std= df_melt.groupby('year').std()
df_group_std

         value
year
2010  1.224745
2011  3.049590

In [ ]:
#分组聚合aggregate(）函数，简写为agg(）

In [175]:
df_group1=df_melt.groupby(['x','year']).aggregate({ np.mean, np.median}) 
#df_group2=df_melt.groupby(['x','year']).agg({'value':{'mean':np.mean,'median':np.median}}) 
#df_group3=df_melt.groupby(['x','year'], as_index=False).agg({'value':{'mean':np.mean,'median':np.median}})
df_group1

       value
        mean median
x year
A 2010   2.5    2.5
  2011   5.5    5.5
B 2010   3.0    3.0
  2011   5.0    5.0
C 2010   3.5    3.5
  2011   5.5    5.5

In [176]:
#df_group1=df_melt.groupby(['x','year'],as_index=False).aggregate({ np.mean, np.median})

In [177]:
df_group1.index

MultiIndex([('A', '2010'),
            ('A', '2011'),
            ('B', '2010'),
            ('B', '2011'),
            ('C', '2010'),
            ('C', '2011')],
           names=['x', 'year'])

In [178]:
#分组运算：transform(）函数
#transform(）函数可以结合groupby()来方便地实现类似SQL中的分组运算的操作。
df_melt['percentage'] = df_melt.groupby('x')['value'].transform(lambda x: x / x.sum())
df_melt

   x  year  value  percentage
0  A  2010      1    0.062500
1  B  2010      3    0.375000
2  C  2010      4    0.222222
3  A  2010      4    0.250000
4  C  2010      3    0.166667
5  A  2011      3    0.187500
6  B  2011      5    0.625000
7  C  2011      2    0.111111
8  A  2011      8    0.500000
9  C  2011      9    0.500000

In [179]:
#分组筛选：filter(）函数,可以结合groupby来方便地实现类似SQL中的分组筛选运算的操作 
df_filter=df_melt.groupby('x').filter(lambda x: x['value'].mean()>4) 
df_filter

   x  year  value  percentage
2  C  2010      4    0.222222
4  C  2010      3    0.166667
7  C  2011      2    0.111111
9  C  2011      9    0.500000